{
    "scenes": [{
        "scene_n": 1,
        "scene_id": 1,
        "scene_title": "Peripetiea",
        "locations": [{
            "location_id": "Init_house", "sub_locations_id": "kitchen"
        }],
        "on_complete": {
            "location": ["shop"]
        },
        "intro_text": [
            { "text": "The day was disrupted by the noise that rules the world.", "weight": 2 },
            { "text": "I was sitting with my friends, celebrating our university’s third anniversary. It was the happiest moment I can remember.", "weight": 2 },
            { "text": "The four of us had formed a bond of shared memories, thoughts, and fun.", "weight": 1 },
            { "text": "Mark sat in front of me, always trying to eat as much as he could. Despite his speech problems, he was a great guy to be around. His dream was to finish university and become a nursery assistant to support his demanding family on the other side of the world.", "weight": 3 },
            { "text": "Alex, another close friend, was one of those people whose jokes could brighten anyone’s day. He didn’t study much, but he was full of ambition and wanted to become a professional boxer. I remember his arguments with Derick, the guy whose words always carried weight.", "weight": 3 },
            { "text": "Derick was the quiet one in our group. He rarely spoke, but when he did, it always felt thoughtful and precise. He studied architecture and dreamed of building a house for his parents back home. His calmness balanced the rest of us.", "weight": 3 },
            { "text": "On the left side of the table sat Dom (Dominic). He was the opposite of Derick – loud, cheerful, always laughing before anyone even understood the joke. He wanted to become a journalist, even though his stories were mostly chaotic tales that ended with 'and then we ran.' He kept the group alive. At that time. Alive, when the world outside wasn’t dead yet.", "weight": 3 },
            { "text": "Alex: AYYYEE! I told you they were gonna win! Ha-ha, 5:2! How shameful, innit, Zack?", "weight": 2 },
            { "text": "Tom: Who would’ve even THOUGHT that would happen? Still… 15 UCL tho.", "weight": 2 },
            { "text": "Alex: Ahh, don’t remind me of that last UCL. I was basically in baby chair watching that. Wake up, Zack, you’re living today, lil genius.", "weight": 2 },
            { "text": "Derick: Guys, they keep winning and losing every day. But have you ever thought about your life after university?", "weight": 2 },
            { "text": "Said, what are you going to do then?", "weight": 1 },
            { "text": "Said: Bro, let me eat the salad first, lol.", "weight": 1 },
            { "text": "Okay, honestly? I haven’t decided yet.", "weight": 1 },
            { "text": "The world is chaotic. I don’t even know if my choices are gonna make sense tomorrow.", "weight": 1 },
            { "text": "Me: guys, lest drop off those though, you are really confusing me now. Instead, let's raise a glass to our friendship!", "weight": 2 },
            { "text": "Tom: Ahhh, never mind, guys, I agree with him!", "weight": 1 },
            { "text": "We raised the glass and drunk the green tee.", "weight": 3 },
            { "text": "Suddenly, the TV barked with a noise like a shredder.", "weight": 1 },
            { "text": "Faces appeared on the screen — empty, expressionless, hidden behind black masks shaped like smiling emojis.", "weight": 1 },
            { "text": "Their voices sounded friendly.", "weight": 1 },
            { "text": "Their intentions were horrifying.", "weight": 1 },
            { "text": "Hello, dear humanity!", "weight": 0 },
            { "text": "said the figure — calling humans humane with a sarcasm sharp enough to cut glass.", "weight": 1 },
            { "text": "It sounded like a line ripped straight from a Hollywood nuclear-war movie.", "weight": 1 },
            { "text": "We are happy to announce that you are going to be wiped out.", "weight": 1 },
            { "text": "Humanity has already rotted — no fairness, no truth.", "weight": 1 },
            { "text": "Only drama. Only tragedies.", "weight": 1 },
            { "text": "The rich rule the world, the poor are denied the world.", "weight": 1 },
            { "text": "Nothing is changeable on this earth.", "weight": 1 },
            { "text": "Your destiny is inevitable.", "weight": 1 },
            { "text": "Alex: Ahh, someone get rid of that Diddy on the screen.", "weight": 1 },
            { "text": "Why would some masked clown dare to talk like that?", "weight": 1 },
            { "text": "Derick: Alex… tss", "weight": 1 },
            { "text": "The screen appeared darker, as if someone increased the contrast by 100 in some bad photoshop. Hence there, the world was never as usual again.", "weight": 1 },
            { "text": "You have ten hours left to live", "weight": 1 },
            { "text": "Nuclear warheads from all over the world are ready to be launched.", "weight": 1 },
            { "text": "We thank the thousands of insiders who helped us bring 'fairness' to this world.", "weight": 1 },
            { "text": "Even the Russian nuclear arsenal, which is known as the biggest in the world, is prepared to carry us into the Fifth Contraversion.", "weight": 1 },
            { "text": "And we have more than one nation behind us. China, USA, UK, France, Germany, Israel, Brazil, Australia, and so on are under our control.", "weight": 1 },
            { "text": "Even the very country from which you are hearing this message now. See u in a next life!", "weight": 1 },
            { "text": "Alex: Whoever made that — nice joke. Lol, I would never believe such nonsense.", "weight": 1 },
            { "text": "Tom: Guys… hang on. Someone’s calling me.", "weight": 1 },
            { "text": "Alr— …what the actual hell?", "weight": 1 },
            { "text": "Dom: What happened?", "weight": 1 },
            { "text": "Derrick: What’s wrong, dude?", "weight": 1 },
            { "text": "Dom: Come on, Tom. Will you start talking?", "weight": 1 },
            { "text": "Tom’s hands began to shake. His face turned red, frozen in shock, his breathing sharpened — he didn’t even know what to do.", "weight": 1 },
            { "text": "As he showed us his phone, everyone else’s devices lit up almost at the same time.", "weight": 1 },
            { "text": "It was a government alert — warning about an imminent risk of death and confirmed nuclear launches.", "weight": 1 },
            { "text": "It told us not to panic, to be ready for anything, and that authorities were working to disable every single nuclear warhead.", "weight": 1 },
            { "text": "But the message felt like a goodbye.", "weight": 1 },
            { "text": "When the phones finally stopped buzzing, the silence that followed was one of the most terrifying and suffocating moments I had ever lived through.", "weight": 1 },
            { "text": "It wasn’t peaceful — it felt heavy, like the air itself refused to move.", "weight": 1 },
            { "text": "And then — screams.", "weight": 1 },
            { "text": "From every corner of the building.", "weight": 1 },
            { "text": "People were rushing, stumbling over chairs, over each other.", "weight": 1 },
            { "text": "A chaotic jumble of shouts, cries, sobs, gasps, arguments — even the dull thuds of bodies bumping into walls — all crashed into the room at once.", "weight": 1 }
        ]
        },
        {
        "scene_n": 2,
        "scene_id": 2,
        "scene_title": "Preparation",
        "locations": [{
            "location_id": "Init_house",
            "sub_locations_id": "hall"
        }],
        "on_complete": {
            "location": ["street_bullet"]
        },
        "intro_text": [
            { "text": "The screams outside didn’t stop. They trembled in the walls like a living echo.", "weight": 2 },
            { "text": "Alex grabbed my arm. 'Bro… we need to get ready. We can’t stay here.'", "weight": 2 },
            { "text": "My hands were shaking. How do you prepare for the end of the world?", "weight": 1 },
            { "text": "Tom: 'We need essentials. Passport. Food. Anything we can carry.'", "weight": 1 },
            { "text": "Derick checked the hallway. 'We don’t have long. Grab what you can.'", "weight": 1 },
            { "text": "I rushed to the kitchen — my mind blank, my body running on instinct.", "weight": 2 },
            { "text": "Alex: 'Bro, hurry! We need to be out in minutes!'", "weight": 1 },
            { "text": "Dom: 'Guys, I heard glass break upstairs… people are losing it!'", "weight": 1 },
            { "text": "I had one mission: find my passport, knife, and enough food to survive one day.", "weight": 2 },
            { "text": "Drawers slammed, shelves rattled — everything mattered now.", "weight": 1 }
        ]
        },
        {
        "scene_n": 3,
        "scene_id": 3,
        "scene_title": "Bullet Street",
        "locations": [{
            "location_id": "street_bullet",
            "sub_locations_id": "crosswalk"
        }],
        "on_complete": {
            "location": ["parking_zone"]
        },
        "intro_text": [
            { "text": "The street looked like another world — smoke, running silhouettes, broken voices.", "weight": 2 },
            { "text": "A man bumped into me so hard I almost fell. His eyes were swallowed by fear.", "weight": 1 },
            { "text": "Dom: 'This is insane… I’ve never seen humans act like this.'", "weight": 1 },
            { "text": "Tom: 'Keep moving! Parking lot is two blocks away!'", "weight": 1 },
            { "text": "Then I saw her — a woman lying near the wall, barely conscious.", "weight": 2 },
            { "text": "Her arm was twisted unnaturally. Bruises covered her face.", "weight": 1 },
            { "text": "Sara: 'P-please… help me… my husband… he’s looking for me…'", "weight": 1 },
            { "text": "Alex whispered: 'Bro, we don’t have time. She’s done.'", "weight": 1 },
            { "text": "Derick: 'Shut up, Alex. He decides.'", "weight": 1 },
            { "text": "The world froze. One path meant saving her. The other — saving us.", "weight": 2 }
        ]
        },
        {
        "scene_n": 4,
        "scene_id": 4,
        "scene_title": "Parking Lot",
        "locations": [{
            "location_id": "parking_zone",
            "sub_locations_id": "lot_center"
        }],
        "on_complete": {
            "location": ["shop_industrial"]
        },
        "intro_text": [
            { "text": "The parking lot was a graveyard of abandoned cars and dropped belongings.", "weight": 2 },
            { "text": "We reached our car. Dust covered the windows — I hadn’t touched it in months.", "weight": 1 },
            { "text": "Tom: 'Try it. Just try to start it.'", "weight": 1 },
            { "text": "I turned the key. Nothing. Not even a cough.", "weight": 2 },
            { "text": "Alex: 'Bro… we’re screwed. Starter’s dead.'", "weight": 1 },
            { "text": "Dom: 'Maybe if we push it? Try rolling?'", "weight": 1 },
            { "text": "We pushed with all our strength. The car rolled, choked, and died again.", "weight": 2 },
            { "text": "Alex: 'Okay. I know what's wrong. But we need a replacement part.'", "weight": 1 },
            { "text": "Derick: 'Where do we find it?'", "weight": 1 },
            { "text": "Alex: 'There’s a shop ten minutes away… if it’s still there.'", "weight": 2 }
        ]
        },
        {
        "scene_n": 5,
        "scene_id": 5,
        "scene_title": "The Shop of Last Hope",
        "locations": [{
            "location_id": "shop_industrial",
            "sub_locations_id": "aisle_entrance"
        }],
        "on_complete": {
            "branch": ["scene_6A", "scene_6B"]
        },
        "intro_text": [
            { "text": "The shop was silent — unnervingly silent. Shelves still full, untouched by panic.", "weight": 2 },
            { "text": "An older man stood at the counter — tired eyes, silver hair.", "weight": 1 },
            { "text": "Old Man: 'You boys need something?'", "weight": 1 },
            { "text": "Alex: 'Starter module. Please.'", "weight": 1 },
            { "text": "Old Man sighed. 'Take it. Take anything… I’ve lived long enough.'", "weight": 2 },
            { "text": "Then the door slammed open with violent force.", "weight": 1 },
            { "text": "Armed men rushed inside — shouting, kicking shelves, grabbing whatever they wanted.", "weight": 2 },
            { "text": "Bandit: 'Hands up! No hero shit!'", "weight": 1 },
            { "text": "Tom: 'Bro— hide! NOW!'", "weight": 1 },
            { "text": "The store turned into a maze — shelves, crates, shadows, panic.", "weight": 2 },
            { "text": "My heart punched my ribs like it wanted out of my body.", "weight": 1 },
            { "text": "If I hid — we had a chance. If I failed — everything was gone.", "weight": 2 }
        ]
        },
        {
        "scene_n": 6,
        "scene_id": "6A",
        "scene_title": "Escape with the Part",
        "locations": [{
            "location_id": "shop_industrial",
            "sub_locations_id": "back_exit"
        }],
        "on_complete": {
            "location": ["parking_zone"]
        },
        "intro_text": [
            { "text": "I held my breath behind the shelf, motionless. One wrong sound would cost us everything.", "weight": 2 },
            { "text": "Footsteps echoed between the aisles — slow, searching, predatory.", "weight": 1 },
            { "text": "Dom covered his mouth to keep from breathing too loudly.", "weight": 1 },
            { "text": "Alex peeked through a crack. He whispered: 'Bro… one of them is coming our way.'", "weight": 2 },
            { "text": "Suddenly, a loud crash distracted the gunmen. A shelf collapsed near the front of the store.", "weight": 1 },
            { "text": "Derick: 'Now. MOVE.'", "weight": 2 },
            { "text": "We sprinted through the back exit, carrying the stolen starter module.", "weight": 2 },
            { "text": "Our lungs burned, but the parking lot was close. If we made it — we lived.", "weight": 1 }
        ]
        },
        {
        "scene_n": 6,
        "scene_id": "6B",
        "scene_title": "The Taking",
        "locations": [{
            "location_id": "shop_industrial",
            "sub_locations_id": "main_floor"
        }],
        "on_complete": {
            "location": ["parking_zone"]
        },
        "intro_text": [
            { "text": "I tried to hide — but it was too late.", "weight": 2 },
            { "text": "A hand grabbed my shoulder and slammed me against the shelf.", "weight": 1 },
            { "text": "Bandit: 'Thought you could play hero?'", "weight": 1 },
            { "text": "Dom shouted, but another gunman pointed a pistol at him.", "weight": 1 },
            { "text": "They ripped the car keys from Alex's pocket.", "weight": 2 },
            { "text": "Bandit Leader: 'You're coming with us. Show us the car.'", "weight": 2 },
            { "text": "Alex looked at me — terrified but trying to smile. 'Bro… it's okay. Just survive.'", "weight": 1 },
            { "text": "They dragged him away. His voice slowly faded into the distance.", "weight": 2 },
            { "text": "We had nothing. No car. No supplies. And Alex… gone.", "weight": 2 }
        ]
        },
        {
        "scene_n": 7,
        "scene_id": 7,
        "scene_title": "No Direction",
        "locations": [{
            "location_id": "country_road",
            "sub_locations_id": "inside_car"
        }],
        "on_complete": {
            "location": ["field_rest"]
        },
        "intro_text": [
            { "text": "The car rolled through the ruins of the city, headlights cutting through smoke.", "weight": 2 },
            { "text": "Tom gripped the wheel with trembling hands.", "weight": 1 },
            { "text": "Zack tapped his knee nervously — a steady beat of fear.", "weight": 1 },
            { "text": "Most of the apps on my phone refused to load.", "weight": 2 },
            { "text": "Every navigation app displayed the same message: 'Service unavailable.'", "weight": 1 },
            { "text": "Tom: 'Bro, we can’t drive blindly. Find SOMETHING.'", "weight": 2 },
            { "text": "I scrolled through my phone — screenshots, old projects, offline files.", "weight": 1 },
            { "text": "Somewhere in this digital graveyard, a map had to exist.", "weight": 2 }
        ]
        },
        {
        "scene_n": 8,
        "scene_id": 8,
        "scene_title": "Field of Echoes",
        "locations": [{
            "location_id": "open_field",
            "sub_locations_id": "car_side"
        }],
        "on_complete": {
            "location": ["morning_field"]
        },
        "intro_text": [
            { "text": "Tom killed the engine. Rain dripped softly onto the metal roof.", "weight": 2 },
            { "text": "The world outside was an empty field — silent, endless, unsettling.", "weight": 1 },
            { "text": "Zack stepped out first, his breath forming pale clouds.", "weight": 1 },
            { "text": "Dom groaned. 'Bro… I’m freezing already.'", "weight": 1 },
            { "text": "Objectives appeared in my mind like survival instincts whispering commands.", "weight": 2 },
            { "text": "Make fire. Make water. Stay alive.", "weight": 2 },
            { "text": "Hours later, after collapsing near the dying flames — something touched the car door.", "weight": 2 },
            { "text": "A slow, scraping, deliberate sound.", "weight": 1 },
            { "text": "I turned my head — glowing eyes surrounded us.", "weight": 2 }
        ]
        },
        {
        "scene_n": 9,
        "scene_id": 9,
        "scene_title": "Petrol — The Debt",
        "locations": [{
            "location_id": "petrol_station",
            "sub_locations_id": "pump_area"
        }],
        "on_complete": {
            "branch": ["scene_10_fixedCar", "scene_10_noCar"]
        },
        "intro_text": [
            { "text": "Morning arrived with a pale, colourless light over the empty field.", "weight": 2 },
            { "text": "Dom stared at the car. 'We need fuel. This tank is bone-dry.'", "weight": 1 },
            { "text": "The petrol station looked abandoned — but not dead.", "weight": 1 },
            { "text": "The metal sign creaked as the wind pushed it back and forth.", "weight": 1 },
            { "text": "I grabbed an empty container and approached the pump.", "weight": 2 },
            { "text": "One mistake could destroy the engine forever.", "weight": 1 },
            { "text": "Three minutes. That was all the time we had before something went wrong.", "weight": 2 },
            { "text": "And something DID go wrong.", "weight": 2 },
            { "text": "A black car rolled into the station. Five men stepped out.", "weight": 2 }
        ]
        }   



]
}